/**
 * 
 */
package com.csc.practice;

/**
 * @author 189993
 *
 */
public class ATMTest {

	/**
	 * @param args
	 */
	public static void main(String[] args) {
		//1.建立一間銀行。
		
		//2.為這間銀行建立三個帳戶，分別指定一開始的存款為10,000,000、20,000,000、30,000,000。
		
		//3.為這間銀行設立兩台ATM：A1, A2，分別是SmallATM與CityATM，分別先放入10,000,000以及20,000,000。
		
		//4.計算所有ATM現金總合並印出，預期是30,000,000。
		
		//5.以第一個帳號的卡號與密碼登入第一台ATM A1
		
		//6.提出現金1,000,000。
		
		//7.計算所有ATM現金總合並印出，預期是29,000,000。
		
		//8.計算該帳戶剩餘現金，預期9,000,000。
		
		//9.以該帳戶登入第二台ATM A2
		
		//10.從ATM A2存入2,000,000。
		
		//11.計算所有ATM現金總合並印出，預期是31,000,000。
		
		//12.計算該帳戶剩餘現金，預期11,000,000。
	
	}

}
